{"ABP_3_True": {"ticker": "ABP", "filings": [{"date": "2025-07-24", "accession": "0001213900-25-067345", "url": "https://www.sec.gov/Archives/edgar/data/1893219/000121390025067345/ea0250005-8k_abpro.htm", "summary": "The provided document appears to be an automated notice from the U.S. Securities and Exchange Commission (SEC) indicating that a request rate threshold for accessing their sites has been exceeded. It contains a reminder for users to comply with the SEC's Privacy and Security Policy and provides links for further developer resources and privacy information. The notice does not contain specific details about a company or transaction, as it seems to be a standard SEC notice rather than an 8-K filing with financial information or corporate developments."}, {"date": "2025-06-17", "accession": "0001213900-25-055188", "url": "https://www.sec.gov/Archives/edgar/data/1893219/000121390025055188/ea024600601-8k_abprohold.htm", "summary": "The 8-K filing does not contain specific financial data or company information as it appears to be a notification related to the U.S. Securities and Exchange Commission (SEC) indicating that the request rate threshold for automated access to its sites has been exceeded. It emphasizes compliance with SEC's Privacy and Security Policy and provides links for further information on developer resources and privacy guidelines. No pertinent details about any company’s financials or operational changes are included in this filing."}, {"date": "2025-04-28", "accession": "0001213900-25-035735", "url": "https://www.sec.gov/Archives/edgar/data/1893219/000121390025035735/ea0239349-8k_abprohold.htm", "summary": "The provided content does not include specific financial details or information typically found in an 8-K filing, such as significant corporate events, management changes, or financial results. Instead, it appears to be an error message regarding exceeded request rates when trying to access the SEC's website. If you have a specific 8-K filing text or details you'd like summarized, please provide that."}]}, "DSY_8-K_S-1_S-8_424B3_4_5_True": {"ticker": "DSY", "filings": [{"date": "2025-01-24", "accession": "0001213900-25-006430", "formType": "S-8", "url": "https://www.sec.gov/Archives/edgar/data/1999297/000121390025006430/ea0228659-s8_bigtree.htm", "summary": "The provided SEC filing (Form S-8) does not contain any specific financial details, executive or board changes, offerings, clinical or product news, or risks relevant to the company in question. Instead, the document primarily addresses issues related to automated tool usage on the SEC website, including policies and guidelines for access.\n\nTo summarize:\n- **Content Focus**: Policy regarding automated traffic to SEC.gov, not relevant to specific company details.\n- **Financials**, **Executive Changes**, **Offerings**, **Clinical/Product News**, and **Risks**: No relevant information provided.\n\nFor detailed insights, the specific SEC Form S-8 for the company must be accessed."}, {"date": "2024-04-04", "accession": "0001213900-24-030415", "formType": "424B3", "url": "https://www.sec.gov/Archives/edgar/data/1999297/000121390024030415/ea0200189-08.htm", "summary": "The provided content is not an SEC filing (Form 424B3) but rather an automated response from the U.S. Securities and Exchange Commission regarding access limitations for users employing automated tools. As such, there are no financials, executive or board changes, offerings, clinical or product news, or risks detailed in this document. Please provide the actual SEC filing or specific details for a proper summary."}, {"date": "2024-03-27", "accession": "0001213900-24-026408", "formType": "F-4/A", "url": "https://www.sec.gov/Archives/edgar/data/1999297/000121390024026408/ea0200189-06.htm", "summary": "The SEC filing (Form F-4/A) you provided does not contain any specific financial details, executive or board changes, offerings, clinical or product news, or risk factors. Instead, it primarily consists of a message regarding access limitations to the SEC website for automated tools and describes monitoring and security policies.\n\nKey points extracted are:\n\n- **Access Limitations**: The SEC restricts requests from automated tools to ensure equitable access for all users.\n- **Security Monitoring**: The SEC monitors network traffic for security purposes and unauthorized attempts to upload or change information.\n- **Guidelines on Requests**: Users are limited to 10 requests per second; exceeding this may lead to temporary access restrictions.\n\nUnfortunately, there are no relevant financial or corporate details regarding the filing itself."}, {"date": "2024-03-25", "accession": "0001213900-24-025723", "formType": "F-4/A", "url": "https://www.sec.gov/Archives/edgar/data/1999297/000121390024025723/ea0200189-04.htm", "summary": "The content provided does not contain any specific details regarding financials, executive or board changes, offerings, clinical or product news, or risks related to an SEC filing (Form F-4/A). Instead, it addresses an access limitation regarding automated tools accessing SEC.gov and outlines the policy on automated requests. Therefore, no key facts can be extracted from this document related to the specified topics."}, {"date": "2024-03-13", "accession": "0001213900-24-022191", "formType": "F-4", "url": "https://www.sec.gov/Archives/edgar/data/1999297/000121390024022191/ea0200189-03.htm", "summary": "The content you provided is not an actual SEC filing (Form F-4) but rather an error message indicating that the request originated from an undeclared automated tool. As a result, there are no financials, executive or board changes, offerings, clinical or product news, or relevant risks to summarize from this document, as it does not contain any pertinent information regarding a specific filing. \n\nTo extract important details, please provide the actual content or text from a Form F-4 or any other SEC filing."}]}, "ABP_8-K_S-1_S-8_424B3_4_5_True": {"ticker": "ABP", "filings": [{"date": "2025-08-13", "accession": "0001213900-25-075766", "formType": "424B3", "url": "https://www.sec.gov/Archives/edgar/data/1893219/000121390025075766/ea0253091-424b3_abpro.htm", "summary": "The document provided is an error message indicating that the request to access SEC.gov has been flagged as originating from an undeclared automated tool. There are no financial details, executive or board changes, offerings, clinical or product news, or risks included in this content. It primarily addresses website access policies and does not contain any relevant information regarding an SEC filing (Form 424B3). Thus, no key facts can be extracted from this document."}, {"date": "2025-08-07", "accession": "0001474506-25-000151", "formType": "4", "url": "https://www.sec.gov/Archives/edgar/data/1893219/000147450625000151/xslF345X05/primary_doc.xml", "summary": "The content provided does not contain any specific details from an SEC Form 4 filing. Instead, it addresses issues regarding automated requests to the SEC website and outlines policies for accessing content. Consequently, there are no financials, executive/board changes, offerings, clinical or product news, or risks presented in this text. Please provide a proper SEC Form 4 filing document for an analysis of relevant details."}, {"date": "2025-08-04", "accession": "0001474506-25-000146", "formType": "4", "url": "https://www.sec.gov/Archives/edgar/data/1893219/000147450625000146/xslF345X05/primary_doc.xml", "summary": "The provided text does not contain any specific financial details, executive or board changes, offerings, clinical or product news, or risks relevant to a Form 4 SEC filing. Instead, it focuses on an automated tool's request issue with the SEC's website. Therefore, there are no key facts to summarize from the content as it primarily revolves around website policy and access restrictions."}, {"date": "2025-07-29", "accession": "0001474506-25-000144", "formType": "4", "url": "https://www.sec.gov/Archives/edgar/data/1848367/000147450625000144/xslF345X05/primary_doc.xml", "summary": "The content provided does not include any specific financial details, executive or board changes, offerings, clinical or product news, or relevant risks associated with a Form 4 SEC filing. Instead, it is a message from the U.S. Securities and Exchange Commission indicating that the request originated from an automated tool and provides information regarding access limitations to their site.\n\nTo summarize:\n- No financial details or executive changes were mentioned.\n- There were no offerings or clinical/product updates provided.\n- The document primarily addresses access issues related to automated web requests to the SEC's website.\n\nIf you provide a specific Form 4 filing or relevant text, I would be happy to extract key financial facts and pertinent information for you."}, {"date": "2025-07-29", "accession": "0001474506-25-000143", "formType": "4", "url": "https://www.sec.gov/Archives/edgar/data/1893219/000147450625000143/xslF345X05/primary_doc.xml", "summary": "The document provided is not an SEC Form 4 but rather a message indicating that the request originated from an undeclared automated tool. Consequently, it does not contain any specific financial details, executive or board changes, offerings, clinical or product news, or associated risks. To assist you with the intended summary, please provide the actual SEC Form 4 filing or relevant details."}]}, "DSY_8-K_3_False": {"ticker": "DSY", "filings": []}, "DSY_8-K_3_True": {"ticker": "DSY", "filings": []}, "ABVE_8-K_S-1_S-8_424B3_4_5_True": {"ticker": "ABVE", "filings": [{"date": "2024-04-09", "accession": "0001104659-24-044918", "formType": "424B3", "url": "https://www.sec.gov/Archives/edgar/data/1979484/000110465924044918/tm2326271-20_424b3.htm", "summary": "The provided content does not contain any relevant information from an SEC filing (Form 424B3). It appears to be an error message related to automated tool usage on the SEC website, indicating that the request originated from an undeclared automated tool and is thus restricted.\n\nNo financial details, executive or board changes, offerings, clinical or product news, or risks are present in the document. For key facts, you would need to refer to a valid and properly formatted SEC filing document."}, {"date": "2024-04-05", "accession": "0001104659-24-044421", "formType": "F-4/A", "url": "https://www.sec.gov/Archives/edgar/data/1979484/000110465924044421/tm2326271-15_f4a.htm", "summary": "The document is an error response from the U.S. Securities and Exchange Commission (SEC) website regarding a request made by an automated tool. It does not contain any relevant details regarding financials, executive or board changes, offerings, clinical or product news, or risks associated with a specific Form F-4/A filing. To fully extract important financial details or corporate developments, access to the actual SEC filing is necessary."}, {"date": "2024-04-01", "accession": "0001104659-24-042012", "formType": "F-4/A", "url": "https://www.sec.gov/Archives/edgar/data/1979484/000110465924042012/tm2326271-13_f4a.htm", "summary": "The provided text does not contain any specific financial details, executive or board changes, offerings, clinical or product news, or risks from an SEC filing (Form F-4/A). Instead, it is a general notice regarding access rights and automated tool usage on the SEC website. No substantive information relating to a particular company's financials or strategic actions is present in the text. To extract relevant details, the actual content of the Form F-4/A would need to be reviewed."}, {"date": "2024-03-27", "accession": "0001104659-24-039775", "formType": "F-4/A", "url": "https://www.sec.gov/Archives/edgar/data/1979484/000110465924039775/tm2326271-10_f4a.htm", "summary": "The content provided is a notice from the U.S. Securities and Exchange Commission (SEC) indicating that the access request to the Form F-4/A has originated from an undeclared automated tool. The notice does not contain any details regarding financials, executive/board changes, offerings, clinical or product news, or risks related to the issuer of the Form F-4/A.\n\nAs such, no key facts can be extracted from this notice regarding the SEC filing itself. Further detailed information about the financials and other pertinent updates would need to be accessed directly from the SEC's EDGAR database or the specific form in question."}, {"date": "2024-03-13", "accession": "0001104659-24-033927", "formType": "F-4/A", "url": "https://www.sec.gov/Archives/edgar/data/1979484/000110465924033927/tm2326271-6_f4a.htm", "summary": "The provided content does not contain relevant details from the SEC filing (Form F-4/A). Instead, it consists of a notification from the SEC indicating a restriction on automated tools accessing the site, along with general information about the SEC's web usage policy and security measures.\n\nKey Points not available:\n- Financials\n- Executive or board changes\n- Offerings\n- Clinical or product news\n- Relevant risks\n\nFor a summary of the necessary details, please provide the specific content or text of the SEC filing."}]}, "ADGM_8-K_S-1_S-8_424B3_4_5_True": {"ticker": "ADGM", "filings": [{"date": "2025-09-08", "accession": "0001104659-25-088053", "formType": "424B3", "url": "https://www.sec.gov/Archives/edgar/data/2006986/000110465925088053/tm2525353d3_424b3.htm", "summary": "The provided text does not contain any specific information regarding the SEC filing (Form 424B3), including financials, executive or board changes, offerings, clinical or product news, or relevant risks. The content primarily pertains to a message from the U.S. Securities and Exchange Commission regarding automated tool usage and access policies on their website. \n\nTo provide a meaningful summary, it would be necessary to access the actual SEC filing document containing relevant company information that is subject to analysis."}, {"date": "2025-09-08", "accession": "0001104659-25-088051", "formType": "424B3", "url": "https://www.sec.gov/Archives/edgar/data/2006986/000110465925088051/tm2525353d2_424b3.htm", "summary": "The provided text does not contain any specific details from an SEC filing (Form 424B3) related to financials, executive or board changes, offerings, clinical or product news, and risks. Instead, it appears to be a notification regarding the SEC's policies on automated requests to their website and does not include financial or other corporate information. Therefore, there are no key facts to extract. \n\nIf you have access to the actual Form 424B3 document with specific corporate details, please share it for a summary."}, {"date": "2025-09-08", "accession": "0001104659-25-088048", "formType": "8-K", "url": "https://www.sec.gov/Archives/edgar/data/2006986/000110465925088048/tm2525353d1_8k.htm", "summary": "The content provided does not include any specific details from an SEC Form 8-K filing regarding financials, executive or board changes, offerings, clinical or product news, or risks. It appears to be a generic message indicating that a rate threshold for requests to the SEC's website has been exceeded, rather than the actual contents of a filing. \n\nTherefore, I am unable to extract or summarize key facts as requested. Please provide the relevant details or content of the SEC filing for analysis."}, {"date": "2025-08-13", "accession": "0001558370-25-011422", "formType": "424B3", "url": "https://www.sec.gov/Archives/edgar/data/2006986/000155837025011422/adgm-20250813x424b3.htm", "summary": "The content provided does not contain specific details from the SEC filing (Form 424B3) related to financials, executive/board changes, offerings, clinical or product news, or risks. Instead, it is an automated response from the SEC website indicating restrictions on automated requests and encouraging proper access methods. For accurate analysis, please provide the actual text or details of the SEC filing."}, {"date": "2025-08-13", "accession": "0001558370-25-011421", "formType": "424B3", "url": "https://www.sec.gov/Archives/edgar/data/2006986/000155837025011421/adgm-20250813x424b3.htm", "summary": "The content provided does not contain any specific information from an SEC filing (Form 424B3) relating to financials, executive or board changes, offerings, clinical or product news, or related risks. Instead, it appears to be a generic response regarding automated access to the SEC website without any pertinent details of an actual filing. To summarize, there are no key facts available from the document you provided. Please check the source of the SEC filing for relevant information."}]}, "ABP_8-K_S-1_S-8_424B3_4_5_True_False": {"ticker": "ABP", "filings": [{"date": "2025-08-13", "accession": "0001213900-25-075766", "formType": "424B3", "url": "https://www.sec.gov/Archives/edgar/data/1893219/000121390025075766/ea0253091-424b3_abpro.htm", "summary": "**Key Facts from SEC Filing (Form 424B3) for Abpro Holdings, Inc.:**\n\n- **Document Type**: Prospectus Supplement No. 3, filed pursuant to Rule 424(b)(3).\n  \n- **Registration Information**: Part of registration statement on Form S-1 (No. 333-284021).\n\n- **Filing Date**: August 13, 2025.\n\n- **Market Listing**: Shares of Common Stock and Public Warrants are listed on the Nasdaq Global Market under the symbols “ABP” and “ABPW”, respectively.\n\n- **Share Prices** (as of August 12, 2025): \n  - Common Stock: $0.25 per share\n  - Public Warrants: $0.03 per Public Warrant\n\n- **Financial Information**: The prospectus supplement is tied to the Quarterly Report on Form 10-Q for the fiscal quarter ended June 30, 2025.\n\n- **Risks**: Investors are advised to carefully review the risks and uncertainties described in the \"Risk Factors\" section of the Prospectus.\n\n- **Use of Supplement**: This filing supplements the information in the Prospectus and should be read in conjunction with it.\n\n- **Warrants and Offerings**: While specific details on new offerings beyond pricing were not provided, the context suggests possible future capital raising or warrant exercise discussions.\n\n- **Executive/Board Changes**: No specific changes or announcements related"}, {"date": "2025-08-07", "accession": "0001474506-25-000151", "formType": "4", "url": "https://www.sec.gov/Archives/edgar/data/1893219/000147450625000151/xslF345X05/primary_doc.xml", "summary": "### Key Facts from SEC Form 4\n\n1. **Reporting Person**:\n   - Name: Lee Soo Young\n   - Address: C/O Abpro Holdings, Inc., 68 Cummings Park Drive, Woburn, MA 01801\n\n2. **Issuer Information**:\n   - Company: Abpro Holdings, Inc.\n   - Ticker Symbol: ABP\n\n3. **Relationship to Issuer**:\n   - Lee Soo Young is a Director and 10% Owner of Abpro Holdings, Inc.\n\n4. **Transaction Date**:\n   - The earliest transaction date reported is July 25, 2025.\n\n5. **Transaction Details**:\n   - No specific transaction details regarding the amount or type of securities were provided in the visible sections.\n\n6. **Ownership Post-Transaction**:\n   - The amount of securities beneficially owned following the reported transaction(s) is indicated but not detailed.\n\n7. **Filing Type**:\n   - This form is filed by one reporting person, indicating individual ownership changes rather than joint reporting.\n\nNo significant clinical or product news, offerings, or risks were reported in the preliminary sections of the form. Further details would require information from the subsequent tables typically present in a Form 4 concerning the specific transactions involved."}, {"date": "2025-08-04", "accession": "0001474506-25-000146", "formType": "4", "url": "https://www.sec.gov/Archives/edgar/data/1893219/000147450625000146/xslF345X05/primary_doc.xml", "summary": "**SEC Form 4 Summary: Abpro Holdings, Inc. (Ticker: ABP)**\n\n- **Reporting Person**: Suk Jin Wook (Miles)\n  - **Position**: CEO and Chairman, also serves as a Director and 10% Owner.\n  \n- **Transaction Date**: July 31, 2025\n\n- **Securities Information**: \n  - The specific details regarding the type, quantity, and transaction code for securities acquired or disposed of are not fully provided in the snippet, but this form typically includes these aspects.\n  \n- **Ownership Changes**: \n  - There are no details on the number of shares or the nature of the transaction (such as acquisition or disposal of shares) in the visible portion.\n\n- **Filing Class**: This Form 4 is filed as a statement of changes in beneficial ownership, indicating that the reporting person has made changes relating to their holdings.\n\n- **Risks/Concerns**: \n  - The snippet does not specify any direct risks. Generally, changes in ownership could indicate confidence or lack thereof in the company, but further context is needed.\n\n- **General Note**: As this is a Form 4, it primarily deals with insider trading activities rather than broader financials or clinical/product news. \n\n*For complete details on the transaction specifics, one would need to view the entire filing, especially the sections detailing the type of securities and transaction codes.*"}, {"date": "2025-07-29", "accession": "0001474506-25-000144", "formType": "4", "url": "https://www.sec.gov/Archives/edgar/data/1848367/000147450625000144/xslF345X05/primary_doc.xml", "summary": "**Key Facts from SEC Filing (Form 4 – Abpro Holdings, Inc.)**\n\n1. **Reporting Person:** Anthony D. Eisenberg, Director and 10% Owner.\n   \n2. **Issuer Information:**\n   - Company: Abpro Holdings, Inc.\n   - Ticker Symbol: ABP.\n\n3. **Transaction Details:**\n   - Date of Transaction: July 25, 2025.\n   - Type of Filing: Individual filing by a single reporting person.\n\n4. **Securities Information:**\n   - **Title of Security:** Non-specified.\n   - **Transaction Code:** Not specified.\n   - Details regarding the amount of securities acquired or disposed of and the posture of ownership post-transaction are not expressly detailed in the provided excerpt.\n\n5. **Potential Risks:** \n   - Not specified in the filing excerpt, but changes in ownership stakes by significant holders (like directors or 10% owners) can imply shifts in management confidence or strategic direction.\n\n6. **Other Notes:** No amendments or additional original filing dates mentioned; thus, it appears to be a straightforward reporting of changes in ownership.\n\n**Summary:** This Form 4 provides insights into ownership changes at Abpro Holdings, specifically focusing on transactions involving key stakeholders such as Directors and major owners. While specific financial transactions or their implications are not detailed, the filing indicates a notable ownership activity that could affect market perceptions and share valuations."}, {"date": "2025-07-29", "accession": "0001474506-25-000143", "formType": "4", "url": "https://www.sec.gov/Archives/edgar/data/1893219/000147450625000143/xslF345X05/primary_doc.xml", "summary": "**SEC Form 4 Summary for Abpro Holdings, Inc. (ABP)**\n\n- **Reporting Person**: Suk Jin Wook (Miles), CEO and Chairman of Abpro Holdings, Inc.\n- **Transaction Date**: July 25, 2025.\n- **Issuer**: Abpro Holdings, Inc. (Ticker: ABP).\n\n**Key Details**:\n- **Ownership Changes**: The form indicates non-derivative securities transactions, specifically acquisitions or dispositions of shares by the CEO.\n- **Transaction Codes**: The specific details of the transactions (such as quantity and price of securities acquired/disposed) have not been provided in the text.\n- **Forms Filed**: This is a report filed by a single reporting person (Suk Jin Wook), indicating no joint filings.\n\n**Financial Impact**:\n- No specific financial values or amounts of securities were disclosed in the text.\n\n**Executive Changes**:\n- Suk Jin Wook is noted as both an officer (CEO) and a director of the company.\n\n**Risks**:\n- No risks are explicitly detailed in the provided information.\n\n**Conclusion**: The filing signals activity by a key executive related to the company's equity securities, but further financial details and specific transaction values are not specified in the excerpt."}]}, "LOT_8-K_S-1_S-8_424B3_4_5_True_False": {"ticker": "LOT", "filings": [{"date": "2025-06-20", "accession": "0001104659-25-060818", "formType": "424B3", "url": "https://www.sec.gov/Archives/edgar/data/1962746/000110465925060818/tm2518380-2_424b3.htm", "summary": "**Summary of SEC Filing (Form 424B3) for Lotus Technology Inc.**\n\n1. **Offerings**: \n   - Up to **44,450,000 American Deposit Shares (ADS)** representing ordinary shares, with **43,750,000 ADS** available for sale to Westwood Capital Group LLC (the \"Selling Securityholder\") based on market prices, along with **700,000 ADS** already issued as a commitment fee.\n   - The potential for Lotus Technology to receive up to **$350,000,000** from the sale of these ADSs under the purchase agreement dated September 16, 2024.\n\n2. **Financial Information**: \n   - The purchase agreement indicates a formula-based price for issuing ADSs depending on their market price at the time of issuance.\n   - Recent market price example: **$2.16 per ADS** on May 29, 2025.\n\n3. **Corporate Structure**:\n   - Lotus Technology is incorporated as a **Cayman Islands holding company** conducting operations through subsidiaries in China and Europe.\n   - Mr. Shufu Li owns over **50%** of the voting power, designating Lotus as a **controlled company** under Nasdaq's corporate governance guidelines.\n\n4. **Regulatory Status**:\n   - Lotus is classified as an **emerging growth company**, allowing it to benefit from reduced reporting requirements under the JOBS Act.\n   - It is also a **foreign private issuer**, which"}, {"date": "2025-06-20", "accession": "0001104659-25-060801", "formType": "424B3", "url": "https://www.sec.gov/Archives/edgar/data/1962746/000110465925060801/tm2518380-1_424b3.htm", "summary": "### Key Facts from SEC Filing (Form 424B3) for Lotus Technology Inc.\n\n#### Financials:\n- **Securities Offer**: Up to 15,037,030 American Depositary Shares (ADSs) underlying warrants, and 680,957,495 ADSs being sold by existing securityholders.\n- **Warrant Details**: \n  - 9,550,246 ADSs are issuable upon the exercise of Public Warrants at $11.50 each; these were exchanged on February 22, 2024.\n  - 5,486,784 ADSs issuable upon the exercise of Sponsor Warrants at $11.50 each, linked to a private placement worth $8.23 million during an initial public offering.\n- **Closing Prices (May 29, 2025)**:\n  - ADS: $2.16\n  - Warrants: $0.14\n\n#### Executive/Board Changes:\n- No specific changes in executive leadership or board members were mentioned in this filing.\n\n#### Offerings:\n- **Total Registration**: Up to 680,957,495 ADSs can be offered by selling securityholders including several partnerships and investment funds, with prior acquisition prices ranging from approximately $0.60 to $6.60 per share.\n- **Redemption Event**: 20,518,519 LCAA Public Shares were redeemed at a price of $10.86 per share, totaling approximately $222.8 million,"}, {"date": "2025-02-28", "accession": "0001104659-25-018629", "formType": "424B3", "url": "https://www.sec.gov/Archives/edgar/data/1962746/000110465925018629/tm257928d3_424b3.htm", "summary": "### Key Facts from SEC Filing (Form 424B3)\n\n**Company Overview:**\n- **Name:** Lotus Technology Inc.\n- **Address:** No. 800 Century Avenue, Pudong District, Shanghai, People’s Republic of China.\n\n**Offering Details:**\n- **Total American Depositary Shares (ADS):** 44,450,000\n  - **Breakdown:**\n    - **Up to 43,750,000 ADSs** may be issued to Westwood Capital Group LLC, pursuant to a Securities Purchase Agreement dated September 16, 2024.\n    - **700,000 ADSs** have already been issued to Westwood as a commitment to subscribe for additional ADSs.\n\n**Financial Information:**\n- **Current ADS Price:** $2.23 (as of February 27, 2025).\n- **ADS Trading Symbol on Nasdaq:** \"LOT\".\n\n**Regulatory Information:**\n- Filed pursuant to Rule 424(b)(3), as part of Registration Statement No. 333-282217.\n- This filing supplements the prospectus dated September 30, 2024.\n\n**Risk Factors:**\n- Investing in these securities involves a high degree of risk. Specific risk factors can be found in the Prospectus, beginning on page 17.\n\n**Note:**\n- The information in this supplement should be read in conjunction with the original Prospectus. Discrepancies should be resolved by referring to this supplemental document.\n\n**Filing Date"}, {"date": "2025-02-28", "accession": "0001104659-25-018623", "formType": "424B3", "url": "https://www.sec.gov/Archives/edgar/data/1962746/000110465925018623/tm257928d2_424b3.htm", "summary": "### Summary of SEC Filing (Form 424B3)\n\n**Company Information**\n- **Name:** Lotus Technology Inc.\n- **SEC Filing Date:** February 28, 2025\n- **Address:** No. 800 Century Avenue, Pudong District, Shanghai, People's Republic of China.\n\n**Financial Highlights**\n- **American Depositary Shares (ADS):** \n  - 15,037,030 underlying shares from Warrants.\n  - Total of 680,957,495 ADS available for resale.\n  - 5,486,784 Warrants to purchase Ordinary Shares.\n- **Stock Prices as of February 27, 2025:**\n  - ADS closing price: $2.23 per share.\n  - Warrants closing price: $0.100 per warrant.\n\n**Executive/Board Changes**\n- No specific changes in executive leadership or board members were reported in this filing.\n\n**Offerings**\n- The filing relates to the issuance of ADS upon the exercise of Warrants and outlines the offer and resale of significant Ordinary Shares by selling securityholders.\n\n**Clinical/Product News**\n- No specific clinical or product developments were mentioned in this filing.\n\n**Risks**\n- Investing involves a high degree of risk; interested parties are directed to review the \"Risk Factors\" section on page 17 of the Prospectus for detailed information.\n\n**Notes**\n- Existing information on the prospectus is augmented; it should be read alongside this supplement for completeness.\n- No approval or evaluation"}, {"date": "2025-01-23", "accession": "0001104659-25-005424", "formType": "424B3", "url": "https://www.sec.gov/Archives/edgar/data/1962746/000110465925005424/tm254219d3_424a.htm", "summary": "**Summary of SEC Filing (Form 424B3) for Lotus Technology Inc.:**\n\n- **Offering Details:** \n  - Up to 44,450,000 American Depositary Shares (ADSs) representing 44,450,000 ordinary shares.\n  - Includes 43,750,000 ADSs the company may issue to Westwood Capital Group LLC under a purchase agreement from September 16, 2024.\n  - 700,000 ADSs were issued to Westwood as consideration for their commitment to subscribe for ADSs.\n\n- **Financial Information:**\n  - The closing price of the ADSs on Nasdaq was $3.20 per share on January 22, 2025.\n  \n- **Changes in Executive/Board:**\n  - No specific executive or board changes were mentioned in the summary.\n\n- **Clinical or Product News:**\n  - No clinical or product news was specified in this filing.\n\n- **Risks:**\n  - Investment in the company's securities involves a high degree of risk. Specific risk factors can be found beginning on page 17 of the related Prospectus.\n\n- **Regulatory Note:**\n  - The SEC has not approved or disapproved the securities mentioned, nor do they confirm the accuracy of the prospectus.\n\n- **Date of Document:** \n  - The prospectus supplement is dated January 23, 2025. \n\nThis filing primarily discusses the share offering and provides important financial data. Further details can be found in"}]}, "ANNA_8-K_S-1_S-8_424B3_4_5_True_False": {"ticker": "ANNA", "filings": [{"date": "2025-08-15", "accession": "0001213900-25-077491", "formType": "424B3", "url": "https://www.sec.gov/Archives/edgar/data/1845123/000121390025077491/ea025353303-424b3_aleanna.htm", "summary": "### Key Facts from SEC Filing (Form 424B3)\n\n- **Company Overview**: AleAnna, Inc. \n- **Filing Type**: Prospectus Supplement No. 2, updating information from the prospectus dated April 22, 2025.\n- **Registration Number**: 333-284257.\n\n#### Financials:\n- **Shares and Warrants**:\n  - 11,225,969 shares of Class A Common Stock are issuable upon exercise of warrants.\n  - Last reported sales price (August 15, 2025):\n    - Class A Common Stock: $4.24 per share.\n    - Public Warrants: $0.1599 per warrant.\n- **Public Listings**: Class A common stock and public warrants are traded on Nasdaq under symbols \"ANNA\" and \"ANNAW\", respectively.\n\n#### Executive/Board Changes:\n- Mentioned that a Current Report on Form 8-K has been filed (date: August 15, 2025), but specific changes are not detailed in the extract.\n\n#### Offerings:\n- The prospectus supplement indicates an update to the previous filings, but does not specify new offerings beyond warrant exercise.\n\n#### Clinical or Product News:\n- No clinical or product news details are provided in the excerpt.\n\n#### Risks:\n- The prospectus mentions that investing involves risks, detailed in the \"Risk Factors\" section on page 9 of the Prospectus. No specific risks are described in this"}, {"date": "2025-08-15", "accession": "0001213900-25-077477", "formType": "8-K", "url": "https://www.sec.gov/Archives/edgar/data/1845123/000121390025077477/ea0253533-8k_aleanna.htm", "summary": "### Summary of SEC Form 8-K for Aleanna, Inc. (Date: August 13, 2025)\n\n**Company Overview:**\n- Name: Aleanna, Inc.\n- State of Incorporation: Delaware\n- CIK: 0001845123\n- Commission File Number: 001-41164\n- IRS Employer Tax ID: 98-1582153\n\n**Key Details:**\n1. **Financials:**\n   - No specific financial results disclosed in this filing.\n\n2. **Executive/Board Changes:**\n   - No changes to executive management or board members mentioned in the document.\n\n3. **Offerings:**\n   - No new offerings or securities registrations were detailed.\n\n4. **Clinical or Product News:**\n   - No updates on clinical trials or new products disclosed.\n\n5. **Risks:**\n   - No explicit risks mentioned in the filing.\n\n**Conclusion:**\nThe filing does not present new financial data, executive changes, or significant updates on product or clinical developments as of the report date. Further details may be available in subsequent filings or statements."}, {"date": "2025-08-15", "accession": "0001213900-25-077469", "formType": "424B3", "url": "https://www.sec.gov/Archives/edgar/data/1845123/000121390025077469/ea025353302-424b3_aleanna.htm", "summary": "**Key Facts from SEC Filing (Form 424B3) for AleAnna, Inc.:**\n\n1. **Offering Details:**\n   - AleAnna, Inc. is offering **11,225,969 shares** of Class A Common Stock.\n   - These shares are issuable upon the exercise of warrants.\n\n2. **Warrant Information:**\n   - Public Warrants allow the holder to acquire one share of Class A common stock for **$11.50** each.\n\n3. **Stock and Warrant Prices:**\n   - As of **August 15, 2025**:\n     - Last reported price for Class A Common Stock: **$4.24 per share**.\n     - Last reported price for Public Warrants: **$0.1599 per warrant**.\n\n4. **Company Status:**\n   - AleAnna, Inc. is classified as an **emerging growth company** and a **smaller reporting company**.\n\n5. **Current Report Reference:**\n   - This filing updates the prospectus dated **April 22, 2025**, incorporating information from a **Form 8-K** filed on **June 13, 2025**.\n\n6. **Risks:**\n   - Investing in AleAnna's Class A common stock and Public Warrants involves various risks as detailed in the \"Risk Factors\" section of the Prospectus.\n\n7. **Securities Registration:**\n   - This filing is made pursuant to **Rule"}, {"date": "2025-06-12", "accession": "0001213900-25-053944", "formType": "8-K", "url": "https://www.sec.gov/Archives/edgar/data/1845123/000121390025053944/ea0245555-8k_aleanna.htm", "summary": "**Summary of SEC Form 8-K Filings for Aleanna, Inc. (June 12, 2025)**\n\n- **Company Details**:\n  - Name: Aleanna, Inc.\n  - Incorporation State: Delaware\n  - SEC File Number: 001-41164\n  - Tax Identification Number: 98-1582153\n  - Address: 300 Crescent Court, Suite 1860\n\n- **Date of Report**: June 12, 2025\n\n- **Key Highlights**:\n  - **Financials**: No specific financial figures were provided in the text extract.\n  \n  - **Executive/Board Changes**: The document does not detail any executive or board changes.\n\n  - **Offerings**: There was no mention of new offerings or related financial activities in the extract.\n\n  - **Clinical/Product News**: No specific information regarding clinical or product developments was mentioned.\n\n  - **Risks**: No particular risks were highlighted within the content provided.\n\nThis extraction appears to lack detailed financial or operational specifics, suggesting that it primarily serves as a formal notification of basic corporate details rather than a substantive report on recent events or changes within the company."}, {"date": "2025-05-15", "accession": "0001213900-25-044168", "formType": "8-K", "url": "https://www.sec.gov/Archives/edgar/data/1845123/000121390025044168/ea0242057-8k_aleanna.htm", "summary": "**SEC Filing (Form 8-K) Summary for AleAnna, Inc.**\n\n**Date of Report**: May 15, 2025\n\n**Entity Information**:\n- Company Name: AleAnna, Inc.\n- State of Incorporation: Delaware\n- SEC File Number: 001-41164\n- Employer Identification Number: 98-1582153\n- Address: 300 Crescent Court, Suite 1860\n\n**Key Details**:\n- **Executive/Board Changes**: Not specified in the provided document.\n- **Financials**: No specific financial details included in the provided content.\n- **Offerings**: No information on offerings included in the provided content.\n- **Clinical/Product News**: No relevant product or clinical news noted in the provided content.\n- **Risks**: No risks outlined in the provided document.\n\nThis summary reflects the limited content available from the SEC filing, which lacks detailed financials or additional corporate changes and offerings. Further information may need to be sourced from the complete document or additional filings."}]}, "BRLS_8-K_S-1_S-8_424B3_4_5_True_False": {"ticker": "BRLS", "filings": [{"date": "2025-09-09", "accession": "0001213900-25-085855", "formType": "8-K", "url": "https://www.sec.gov/Archives/edgar/data/1852973/000121390025085855/ea0256564-8k_borealis.htm", "summary": "### Summary of Key Facts from SEC Form 8-K Filing\n\n**Company Name:** Borealis Foods Inc.  \n**Filing Date:** September 8, 2025  \n**Incorporation:** Ontario, Canada  \n**SEC File Number:** 001-40778  \n**IRS Employer Identification Number:** 98-1638988  \n\n#### Financials\n- No specific financial data reported in this filing.\n\n#### Executive/Board Changes\n- The filing does not indicate any changes to executive leadership or the board of directors.\n\n#### Offerings\n- No new offerings or securities issuance announced in this filing.\n\n#### Clinical or Product News\n- No clinical data or product news was disclosed.\n\n#### Risks\n- No specific risks were highlighted in this document.\n\nThis summary presents the main facts from the SEC filing, focusing on financials, executive changes, offerings, product news, and risks. Further details were not available in the provided information."}, {"date": "2025-09-04", "accession": "0001213900-25-084534", "formType": "8-K", "url": "https://www.sec.gov/Archives/edgar/data/1852973/000121390025084534/ea0255851-8k_borealis.htm", "summary": "**SEC Filing Summary (Form 8-K) for Borealis Foods Inc.**\n\n**Date of Report:**\n- August 29, 2025\n\n**Entity Information:**\n- Name: Borealis Foods Inc.\n- Incorporation: Ontario, Canada\n- CIK: 0001852973\n- Entity File Number: 001-40778\n- IRS Identification: 98-1638988\n- Address: 1540 Cornwall Rd., Suite 104, Oakville, ON L6J 7W5\n\n**Key Highlights:**\n- **Financials:** No specific financial data was provided in the filing.\n- **Executive/Board Changes:** No executive or board changes were mentioned in the summary.\n- **Offerings:** No new offerings or securities details were provided.\n- **Clinical/Product News:** There were no updates related to clinical trials or product developments noted.\n- **Risks:** No specific risks were outlined in the summary.\n\n**Conclusion:**\nThis filing lacks detailed information regarding financials, executive changes, offerings, clinical news, or associated risks. For stakeholders, further clarification may be needed from additional filings or reports to assess Borealis Foods Inc.'s current business standing and prospects."}, {"date": "2025-08-19", "accession": "0001213900-25-078601", "formType": "8-K", "url": "https://www.sec.gov/Archives/edgar/data/1852973/000121390025078601/ea0253749-8k_borealis.htm", "summary": "**Summary of SEC Filing (Form 8-K) for Borealis Foods Inc.**\n\n**Date of Report**: August 19, 2025\n\n**Company**: Borealis Foods Inc.\n- **Incorporation**: Ontario, Canada\n- **Entity File Number**: 001-40778\n\n**Key Details**:\n1. **Financials**: The document does not provide specific financial data in the visible content.\n   \n2. **Executive/Board Changes**: Details regarding any changes to the executive team or board of directors are not included in the visible information.\n\n3. **Offerings**: No information is provided about any new offerings such as securities or products in this summary.\n\n4. **Clinical or Product News**: There are no specific updates related to clinical trials or product developments detailed in the visible content.\n\n5. **Risks**: No risks are explicitly noted within the content provided.\n\n**Conclusion**: The available information from the SEC filing does not include substantive financials, executive changes, offerings, clinical or product updates, or identified risks."}, {"date": "2025-05-28", "accession": "0001213900-25-048367", "formType": "4", "url": "https://www.sec.gov/Archives/edgar/data/1852973/000121390025048367/xslF345X05/ownership.xml", "summary": "### Summary of SEC Form 4 Filing:\n\n1. **Reporting Person**: \n   - Name: Shiv Vikram Khemka\n   - Relationship: Director and 10% Owner of Borealis Foods Inc. (Ticker: BRLS)\n   - Address: Borealis Foods Inc., 1540 Cornwall Rd., Suite 104, Oakville, ON L6J7W4\n\n2. **Transaction Details**:\n   - Date of Earliest Transaction: May 27, 2025\n   - The filing does not specify the transaction type or the number of securities involved in the acquisition or disposal.\n\n3. **Ownership Post-Transaction**:\n   - The number of securities beneficially owned following the reported transaction is not provided in the details shown.\n\n4. **Nature of Filing**:\n   - This Form 4 reflects a change in beneficial ownership pursuant to Section 16(a) of the Securities Exchange Act of 1934.\n\n### Key Points to Note:\n- No significant changes in executive positions or board membership apart from the reporting of ownership changes.\n- No clinical or product news is mentioned.\n- Risk factors are not specifically addressed in this filing.\n\nThis filing serves primarily as a disclosure of changes in beneficial ownership of securities by a company director, which is a regulatory requirement for transparency in insider trading activities."}, {"date": "2025-05-28", "accession": "0001213900-25-048366", "formType": "4", "url": "https://www.sec.gov/Archives/edgar/data/1219349/000121390025048366/xslF345X05/ownership.xml", "summary": "**SEC Form 4 Summary: Borealis Foods Inc. (Ticker: BRLS)**\n\n- **Reporting Person**: Ertharin Cousin\n- **Relationship**: Director and 10% Owner\n- **Date of Transaction**: May 27, 2025\n- **Securities Information**:\n  - Transaction involves non-derivative securities\n  - Details on the number of securities acquired, disposed, or beneficially owned were not included in the provided text.\n\n**Key Highlights**:\n- No specific financial details, offering information, clinical or product news, or outlines of risks were disclosed in the available portion of the filing.\n- The filing indicates a transaction related to stock ownership changes as required under Section 16(a) of the Securities Exchange Act of 1934.\n\n**Potential Importance**:\n- Director-level transactions can signal confidence in the company's prospects or potentially indicate a change in corporate strategy or market conditions depending on the nature of the transactions (buying vs. selling). \n\nTo obtain additional details regarding the number of securities involved and any specific transactions codes, further sections of the Form 4 filing would need to be reviewed."}]}, "DSY_8-K_S-1_S-8_424B3_4_5_True_False": {"ticker": "DSY", "filings": [{"date": "2025-01-24", "accession": "0001213900-25-006430", "formType": "S-8", "url": "https://www.sec.gov/Archives/edgar/data/1999297/000121390025006430/ea0228659-s8_bigtree.htm", "summary": "**Summary of SEC Form S-8 Filing for Big Tree Cloud Holdings Limited:**\n\n1. **Registration Details:**\n   - Filing Date: January 24, 2025\n   - Registration No.: 333- (partial)\n   - Type: Registration statement under the Securities Act of 1933\n\n2. **Company Information:**\n   - Name: Big Tree Cloud Holdings Limited\n   - Jurisdiction: Cayman Islands\n   - Principal Office: Room 3303, Building 1, Zhongliang Yunjing Plaza, Shenzhen, China\n\n3. **Equity Incentive Plan:**\n   - The filing pertains to the 2024 Equity Incentive Plan.\n\n4. **Agent for Service:**\n   - Cogency Global Inc., 122 East 42nd Street, 18th Floor, New York, NY 10168\n   - Contact Number: +1 800-221-0102\n\n5. **Legal Counsel:**\n   - Pillsbury Winthrop Shaw Pittman LLP, Shanghai, PRC\n\n6. **Filing Status:**\n   - The company is designated as a non-accelerated filer.\n\n**Key Areas to Note:**\n- The document does not detail specific financials, executive/board changes, offerings, clinical/product news, or risks as related content is not included in the provided text."}, {"date": "2024-04-04", "accession": "0001213900-24-030415", "formType": "424B3", "url": "https://www.sec.gov/Archives/edgar/data/1999297/000121390024030415/ea0200189-08.htm", "summary": "### Key Facts from SEC Filing (Form 424B3):\n\n**Financials:**\n- The filing refers to an offering of **up to 80,253,454 ordinary shares** and **6,016,125 warrants**, with additional **6,016,125 ordinary shares underlying the warrants** for Big Tree Cloud Holdings Limited.\n\n**Executive/Board Changes:**\n- The filing does not specify any changes to the executive team or board of directors.\n\n**Offerings:**\n- This prospectus is part of a special meeting of stockholders for Plutonian Acquisition Corp., to discuss the proposed business combinations and related transactions as outlined in the Merger Agreement.\n\n**Clinical or Product News:**\n- There are no clinical or specific product updates mentioned in the document.\n\n**Business Combination:**\n- Plutonian Acquisition Corp. aims to merge with specific entities as detailed in the Agreement and Plan of Merger with Big Tree Cloud International Group Limited and its subsidiaries, which involves a two-part merger process (Initial Merger and SPAC Merger).\n\n**Risks:**\n- The filing mentions concerns about health due to the COVID-19 pandemic and outlines that the special meeting will be held virtually to ensure safety, which may affect stockholder participation.\n\n### Summary:\nThis filing outlines the upcoming virtual special meeting for Plutonian Acquisition Corp., detailing the offering of shares and warrants related to their merger with Big Tree Cloud. There are no specified financials, executive changes, or product updates at this"}, {"date": "2024-03-27", "accession": "0001213900-24-026408", "formType": "F-4/A", "url": "https://www.sec.gov/Archives/edgar/data/1999297/000121390024026408/ea0200189-06.htm", "summary": "**Key Facts from SEC Filing (Form F-4/A for Big Tree Cloud Holdings Limited)**\n\n1. **Registration Details:**\n   - Registration No: 333-277882\n   - Submission Date: March 27, 2024\n   - Document Type: Amendment No. 2 to Form F-4 Registration Statement under the Securities Act of 1933.\n\n2. **Company Information:**\n   - Exact name of Registrant: Big Tree Cloud Holdings Limited\n   - Jurisdiction: Cayman Islands\n\n3. **Financials:**\n   - No specific financial details or metrics are available within the provided excerpt.\n\n4. **Executive/Board Changes:**\n   - The excerpt does not mention any changes to the executive team or board of directors.\n\n5. **Offerings:**\n   - There are no specific details regarding share offerings or capital raising provided in the presented text.\n\n6. **Clinical or Product News:**\n   - No clinical or product news is detailed within the provided text.\n\n7. **Risks:**\n   - The excerpt does not specify any risks associated with the company or its offerings.\n\nNote: This summary is based on the limited information extracted from the document. Additional details may exist beyond this excerpt which could provide more comprehensive insights."}, {"date": "2024-03-25", "accession": "0001213900-24-025723", "formType": "F-4/A", "url": "https://www.sec.gov/Archives/edgar/data/1999297/000121390024025723/ea0200189-04.htm", "summary": "**Summary of SEC Filing (Form F-4/A) for Big Tree Cloud Holdings Limited**\n\n1. **Filing Type**: Form F-4/A, Amendment No. 1.\n2. **Date Submitted**: March 25, 2024.\n3. **Company Name**: Big Tree Cloud Holdings Limited.\n4. **Location**: Cayman Islands.\n\n**Financials**:\n- No specific financial details or metrics presented in the provided excerpt.\n\n**Executive/Board Changes**:\n- No information on executive or board changes is included in the text provided.\n\n**Offerings**:\n- The document is a registration statement, which typically indicates an intention to offer securities. However, specific offerings or details about the securities are not included in the provided excerpt.\n\n**Clinical/Product News**:\n- No clinical or product news is mentioned in the text.\n\n**Risks**:\n- There are no risks detailed in the excerpt provided.\n\n**Conclusion**: The excerpt does not contain specific financial information, changes in leadership, offerings, clinical updates, or risks. More detailed sections of the filing would need to be reviewed for comprehensive insights."}, {"date": "2024-03-13", "accession": "0001213900-24-022191", "formType": "F-4", "url": "https://www.sec.gov/Archives/edgar/data/1999297/000121390024022191/ea0200189-03.htm", "summary": "### Summary of SEC Filing (Form F-4)\n\n**Company:** Big Tree Cloud Holdings Limited  \n**Filing Date:** March 13, 2024\n\n#### Financials:\n- No specific financial figures are detailed in the excerpt provided.\n\n#### Executive/Board Changes:\n- The excerpt does not provide information about changes to the executive team or board members.\n\n#### Offerings:\n- The Form F-4 serves as a registration statement under the Securities Act of 1933, although specific details regarding the nature or size of any offerings are absent from the excerpt.\n\n#### Clinical or Product News:\n- There is no clinical or product-related news mentioned in the provided extract.\n\n#### Risks:\n- Risks associated with the company or the offering are not discussed in the provided content.\n\nOverall, the provided excerpt does not contain key information on financials, executive changes, offerings, clinical or product updates, or associated risks beyond the general filing details. Further details would be needed to give a comprehensive overview of the company's position."}]}}